app/controllers/topics_controller.rb

INSERT INTO "topics" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-19 11:56:37.459651"], ["description", "3333"], ["title", "333"], ["updated_at", "2014-07-19 11:56:37.459651"]]
---
  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save

UPDATE "topics" SET "description" = ?, "updated_at" = ? WHERE "topics"."id" = 3  [["description", "edd"], ["updated_at", "2014-07-19 13:08:25.251748"]]
---
  def update
    respond_to do |format|
      if @topic.update(topic_params)

SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "votes" ("created_at", "topic_id", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-19 12:58:22.185952"], ["topic_id", 2], ["updated_at", "2014-07-19 12:58:22.185952"]]
---
  def upvote
    @topic = Topic.find(params[:id])
    @topic.votes.create

SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "votes" WHERE "votes"."id" = 16
SELECT  "votes".* FROM "votes"  WHERE "votes"."topic_id" = ?  ORDER BY "votes"."id" DESC LIMIT 1  [["topic_id", 2]]
---
  def downvote
    @topic = Topic.find(params[:id])
    # @topic.votes.destroy
    @topic.votes.last.delete